<?php
/**
 * Created by PhpStorm.
 * User: Yan
 * Date: 2020/6/23
 * Time: 12:00
 */

// 广告配置
return [
    // 广告类型
    'ad_type' => [1 => '图片', 2 => '视频'],

    // 广告所属行业类别 TODO：当类别过多时，创建广告类别表 ad_cate
    'ad_cate' => [
        1 => '餐饮',
        2 => '景区',
        3 => '服装',
        4 => '粮食',
        5 => '生鲜',
        6 => '通信',
        7 => '美容美发',
        8 => '零食',
        9 => '超市',
        10 => '钟表、眼镜零售',
        11 => '五金',
        12 => '家纺',
        13 => '艺术、文化传播',
        14 => '医疗保健',
        15 => '母婴用品',
        16 => '娱乐',
        17 => '鲜花零售业'
    ]
];